Ran Plan for dir: `new-project` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # google_compute_instance.instance1 will be created
+ resource "google_compute_instance" "instance1" {
      + can_ip_forward       = false
      + cpu_platform         = (known after apply)
      + current_status       = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = [
          + {
              + count = 4
              + type  = "nvidia-tesla-t4"
            },
        ]
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "n1-standard-32"
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "instance1"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags_fingerprint     = (known after apply)
      + zone                 = "us-central1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "debian-cloud/debian-9"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + confidential_instance_config {
          + enable_confidential_compute = (known after apply)
        }

      + network_interface {
          + name               = (known after apply)
          + network            = "default"
          + network_ip         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = true
          + on_host_maintenance = (known after apply)
          + preemptible         = true
        }
    }

  # google_dns_record_set.frontend will be created
+ resource "google_dns_record_set" "frontend" {
      + id           = (known after apply)
      + managed_zone = "zone"
      + name         = "frontend.123"
      + project      = (known after apply)
      + rrdatas      = [
          + "123.123.123.123]",
        ]
      + ttl          = 300
      + type         = "A"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

#####

Infracost estimate: monthly cost will increase by 100% (default branch $0 vs current branch $555.20)

--- a/default_branch_infracost.txt
+++ b/current_branch_infracost.txt
+
+  google_compute_instance.instance1                                                                              
+  ├─ Linux/UNIX usage (preemptible, n1-standard-32)          730  hours       0.3200       0.3200      233.6000  
+  ├─ Standard provisioned storage (pd-standard)               10  GiB         0.0400       0.0005        0.4000  
+  └─ NVIDIA Tesla T4 (preemptible)                         2,920  hours       0.1100       0.4400      321.2000  
+  Total                                                                                    0.7605      555.2000  
+                                                                                                                 
+  google_dns_record_set.frontend                                                                                 
+  └─ Queries                                                   -  1M queries  0.4000            -             -  
+  Total                                                                                         -             -  
+                                                                                                                 
+  OVERALL TOTAL (USD)                                                                      0.7605      555.2000  

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d new-project`
* :put_litter_in_its_place: To **delete** this plan click [here](http://6575a96ef53c:4141/lock?id=infracost%252Fatlantis-demo%252Fnew-project%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d new-project`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
